[
{"title": "Last known speaker fights to preserve South African indigenous language", "date": "May 19, 2023", "text": "N|uu was spoken by one of many hunter-gatherer groups that populated Southern Africa before the arrival of European colonizers."},
{"title": "More than half of the world's large lakes are drying up", "date": "May 19, 2023", "text": "Report shows the world's most important freshwater sources lost water at a cumulative rate of around 22 gigatons per year for nearly three decades."},
{"title": "Pentagon accounting error overvalued Ukraine weapons aid by $3 billion, sources say", "date": "May 19, 2023", "text": "The error was the result of assigning a higher than warranted value on weaponry that was taken from U.S. stocks and then shipped to Ukraine."},
{"title": "At the G7 summit in Hiroshima, all eyes will be on ‘Ukraine, Ukraine, Ukraine’", "date": "May 18, 2023", "text": "Discussions on the issue will come at a crucial time for the G7 grouping itself, which has struggled to define its purpose and goals in recent years, as well as for the host country."},
{"title": "Next five years to be hottest ever, likely crossing 1.5 C for a year, says WMO", "date": "May 18, 2023", "text": "Report marks the first time the agency has forecast warming beyond the 1.5 C threshold for at least twelve months as the most likely scenario."},
{"title": "More nations plan for 'health disasters' fueled by climate change", "date": "May 18, 2023", "text": "The health argument for climate action can be very powerful, and can be the one that might motivate governments."},
{"title": "Icy northern U.S. city becomes haven for climate migrants", "date": "May 17, 2023", "text": "Despite its tough environment, Duluth in Minnesota is starting to make a name for itself as a refuge of sorts — for those fleeing global warming."},
{"title": "A billion new air conditioners will save lives but cook the planet", "date": "May 17, 2023", "text": "Demand for air conditioners is surging in markets where both incomes and temperatures are rising, such as India, China, Indonesia and the Philippines."},
{"title": "Global executions highest in five years, Amnesty International says", "date": "May 17, 2023", "text": "Egypt, Iran and Saudi Arabia carried out 90% of the executions recorded last year, the rights group said. The numbers did not include China, it said, citing a lack of transparency."},
{"title": "In first, Kyiv says it shot down volley of Russian hypersonic missiles", "date": "May 17, 2023", "text": "When asked about the Ukrainian claim, Russian Defense Minister Sergei Shoigu dismissed it, the RIA news agency reported."},
{"title": "Putin’s war revives Russia’s dark tradition of informers", "date": "May 16, 2023", "text": "The informers are a reflection of the sweeping changes the invasion has brought to Russia, seeking to eradicate once-tolerated hints of opposition."},
{"title": "Elon Musk documents subpoenaed in Jeffrey Epstein lawsuit by U.S. Virgin Islands", "date": "May 16, 2023", "text": "The subpoena came to light in a request by the Virgin Islands to serve Musk by alternative means because it had been unable to locate and serve him."},
{"title": "New threat to privacy? Scientists sound alarm about DNA tool", "date": "May 16, 2023", "text": "The tool could lead to a range of scientific advances but it also poses a vast range of concerns around consent, privacy and surveillance."},
{"title": "Ukraine hails first gains in six months as Zelenskyy secures drones from U.K.", "date": "May 16, 2023", "text": "Since last week, the Ukrainian military has started to push Russian forces back in and around the embattled city of Bakhmut, its first significant offensive operations since November."},
{"title": "How Turkey's election went wrong for Erdogan's rival", "date": "May 16, 2023", "text": "Neither candidate's ability to break the 50% threshold sets up a historic May 28 runoff — Turkey's first — that Erdogan enters as the strong favorite."},
{"title": "Communities torn as Ukraine turns its back on Moscow-linked church", "date": "May 15, 2023", "text": "Tensions have surfaced in villages across Ukraine as authorities have cracked down on the Ukrainian Orthodox Church."},
{"title": "Sustainable food — not more of it — needed as global hunger soars", "date": "May 15, 2023", "text": "Farmers today grow sufficient crops to feed twice the current population — but but nearly a third of food produced globally is spoiled or thrown away."},
{"title": "Germany is experiencing a mass worker shortage. Can migration fix it?", "date": "May 15, 2023", "text": "About 320,000 more people will reach retirement age this year than become adults, meaning the German economy will lose workers while also having to pay more for pensions."},
{"title": "G7 leaders to target Russian energy and trade in new sanctions steps", "date": "May 15, 2023", "text": "Separately, U.S. officials expect G7 members will agree to adjust their approach to sanctions so that, at least for certain categories of goods, all exports are automatically banned."},
{"title": "Turkey faces runoff election with Erdogan leading", "date": "May 15, 2023", "text": "With almost 97% of ballot boxes counted, Erdogan led with 49.39% of votes and rival Kemal Kilicdaroglu had 44.92%, according to state-owned news agency Anadolu."},
{"title": "Posing as Islamists, Russian hackers take aim at Sweden", "date": "May 14, 2023", "text": "A series of coordinated cyberattacks by suspected Russian hackers intended to jeopardize Sweden's chances of joining NATO have been disrupting its biggest companies."},
{"title": "U.S. Congress and White House begin tough debt limit and budget negotiations", "date": "May 11, 2023", "text": "Time is tight to avoid a historic, economically destabilizing default on government debt, which the Treasury Department has warned could come as soon as June 1."},
{"title": "Human pangenome ushers in 'new age of genetic diagnosis'", "date": "May 11, 2023", "text": "Scientists hope that the more diverse and accurate DNA blueprint for our species will help shed light on a range of diseases."},
{"title": "Mammograms should start at 40, U.S. task force says", "date": "May 10, 2023", "text": "Breast cancer is the second-most common cancer and the second-most common cause of cancer death for women in the United States."},
{"title": "China woos European leaders on trip overshadowed by Kremlin ties", "date": "May 10, 2023", "text": "As the European Union considers sanctions aimed at companies that supply Russia through third countries, China's top envoy warned against imposing sanctions on Chinese firms."},
{"title": "U.S. opens embassy in Tonga in fresh pushback against China in Pacific", "date": "May 10, 2023", "text": "Earlier this year, Washington reopened its embassy in the Solomon Islands after a 30-year absence."},
{"title": "Trump liable for sexually abusing writer and faces $5 million damages", "date": "May 10, 2023", "text": "The jurors rejected E. Jean Carroll's accusation of rape but upheld her other complaints in the closely watched civil trial following less than three hours of deliberations."},
{"title": "Biden indicates he could cancel Japan G7 trip if debt ceiling not resolved", "date": "May 10, 2023", "text": "Biden told reporters he is \"still committed\" to attending the G7 but called the debt limit impasse \"the single most important thing on the agenda.\""},
{"title": "Former Pakistan leader Imran Khan arrested as aides call for nationwide protest", "date": "May 9, 2023", "text": "Khan, a former cricket star, was apparently detained in connection with a corruption investigation involving a plot of land."},
{"title": "Putin touts 'sacred' battle with West in Ukraine as Russia marks pared back Victory Day", "date": "May 9, 2023", "text": "The Russian leader has repeatedly likened the war in Ukraine to the challenges Moscow faced when Adolf Hitler invaded the Soviet Union in 1941."},
{"title": "Drugs developed to treat diabetes may offer new approach against Alzheimer's", "date": "May 9, 2023", "text": "Experts hope that by improving glucose metabolism, and tamping down inflammation in the entire body, they can slow progression of diseases like Alzheimer's and Parkinson's."},
{"title": "Phasing out fossil fuels hasn’t worked. Europe has a new idea for COP28", "date": "May 9, 2023", "text": "Some climate hawks have called for an expansion of renewables, rather than carbon capture technology that leaves the door open for more emissions."},
{"title": "Russia to mark Victory Day under shadow of Ukraine setbacks", "date": "May 9, 2023", "text": "In a major coup for the Kremlin, at least six post-Soviet leaders are expected to attend the military parade, which fetes the Soviet Union's victory over Nazi Germany in 1945."},
{"title": "Zelenskyy arrives in Germany as Ukraine prepares counteroffensive", "date": "May 14, 2023", "text": "Ukraine's president, Volodymyr Zelenskyy, held talks Sunday with his German counterpart at the start of his first visit to Germany since Russia's invasion."},
{"title": "Ukraine’s offensive could set stage for diplomacy with Russia, U.S. officials say", "date": "May 14, 2023", "text": "It is unclear how the officials will define success in the counteroffensive, which could last many months, or how its outcome might affect their approach."},
{"title": "Ukraine’s advances near Bakhmut expose rifts in Russian forces", "date": "May 13, 2023", "text": "Russia’s pro-war bloggers were quick to claim that Ukraine’s long-anticipated counteroffensive had begun, but Ukrainian officials downplayed the advances."},
{"title": "South Africa rejects U.S. accusations of arms shipment to Russia", "date": "May 13, 2023", "text": "South Africa is one of Russia's most important allies on a continent divided over the Ukraine war, but says it is impartial and has abstained from voting on U.N. resolutions on the conflict."},
{"title": "Europe needs stronger line on China ties, ministers urge", "date": "May 13, 2023", "text": "The European Union must unite around a stronger stance toward China as it tries to cope with Beijing’s rising power, several of the bloc’s foreign ministers said."},
{"title": "Families of those lost to COVID wrestle with mixed emotions as emergency ends", "date": "May 12, 2023", "text": "More than 1.1 million Americans have died of COVID-19. The official end to the health emergency is being felt in complicated ways for those affected most acutely."},
{"title": "Ukraine prepares to strike back, with over $30 billion arsenal from allies", "date": "May 12, 2023", "text": "Kyiv’s troops will leverage their new hardware to try to overrun dug-in Russian positions and retake occupied territory, but whether it will be enough remains unclear."},
{"title": "Biden’s debt ceiling meeting with McCarthy pushed to next week", "date": "May 12, 2023", "text": "The delay likely signals that staff-level talks on energy permitting reform and government spending have yielded progress."},
{"title": "Mpox no longer a global health emergency, WHO chief says", "date": "May 12, 2023", "text": "A cousin of the smallpox virus, mpox has mostly been confined to developing countries for years, but spread across Europe and the U.S. last year."},
{"title": "Turkey's Erdogan, master campaigner, faces toughest contest yet", "date": "May 12, 2023", "text": "Uncertainty, anxiety and tension over what the results might hold for Europe's second-biggest country of 85 million people can be felt on the streets."},
{"title": "Trump jokes about sexual abuse verdict, repeats election falsehoods", "date": "May 11, 2023", "text": "An unrepentant Donald Trump held firm to past grievances at the first televised town hall of the 2024 U.S. presidential election."},
{"title": "Europe battling punishing drought and unpredictable weather forecast for 2043", "date": "May 11, 2023", "text": "The continent has warmed nearly twice as fast as the rest of the world over the last three decades, according to the World Meteorological Organization."}
]